Конфигурация/src/Documents/УслугиОтеля/УслугиОтеля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УслугиОтеля</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоБроням</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПоУслугам</registerRecords>
  <attributes>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бронь</name>
      <type>
        <types>DocumentRef.БронированиеНомера</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/БронированиеНомера/БронированиеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БронированиеНомера</name>
  <registerRecords>InformationRegister.БронированиеНомеров</registerRecords>
  <attributes>
    <name>ОсновнойГость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГостей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПребывания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БронируемыйНомер</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <comment>Цена номера за ночь</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/УслугиОтеля/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
    ЗаполнитьУслугиНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ГостьПриИзменении(Элемент)
    ЗаполнитьУслугиНаСервере();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьУслугиНаСервере()

    Если НЕ ЗначениеЗаполнено(Объект.Гость) Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	БронированиеНомераУслуги.Услуга КАК Услуга,
    |	БронированиеНомераУслуги.Количество КАК Количество,
    |	БронированиеНомераУслуги.Цена КАК Цена,
    |	БронированиеНомераУслуги.Сумма КАК Сумма,
    |	БронированиеНомераУслуги.Ссылка КАК Бронь
    |ИЗ
    |	Документ.БронированиеНомера.Услуги КАК БронированиеНомераУслуги
    |ГДЕ
    |	БронированиеНомераУслуги.Ссылка.ОсновнойГость = &Гость
    |	И БронированиеНомераУслуги.Ссылка.Проведен
    |	И БронированиеНомераУслуги.Ссылка.ДатаЗаезда <= &Дата
    |	И БронированиеНомераУслуги.Ссылка.ДатаВыезда >= &Дата";

    Запрос.УстановитьПараметр("Гость", Объект.Гость);
    Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
    
    Результат = Запрос.Выполнить();

    Если Результат.Пустой() Тогда
        Сообщить("Услуги не найдены на эту дату");
        Возврат;
    КонецЕсли;

    Объект.Услуги.Загрузить(Результат.Выгрузить());

КонецПроцедуры
